const challenge = `({
    "title": "INTO ORBIT",
    "missions": [{
            "title": "M01 נסיעה בחלל",
            "description": "התחילו לגלגל כל מטען בברור במורד הרציף לנסיעה בחלל בכל גלגול העגלה חייבת *להיות עצמאית בזמן בו היא מגיעה לחיבור המסילה הראשון*",
            "objectives": [{
                    "id": "M01_1",
                    "title": "מטען רכב עבר את חיבור המסילה הראשון",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M01_2",
                    "title": "מטען אספקה עבר את חיבור המסילה הראשון",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M01_3",
                    "title": "מטען צוות עבר את חיבור המסילה הראשון",
                    "type": "yesno",
                    "default": "no"
                }
            ],
            "score": [function(M01_1, M01_2, M01_3) {
                if (M01_1 === 'no' && M01_2 === 'no' && M01_3 === 'no') {
                    return 0
                }
                if (M01_1 === 'no' && M01_2 === 'no' && M01_3 === 'yes') {
                    return 10
                }
                if (M01_1 === 'no' && M01_2 === 'yes' && M01_3 === 'no') {
                    return 14
                }
                if (M01_1 === 'no' && M01_2 === 'yes' && M01_3 === 'yes') {
                    return 24
                }
                if (M01_1 === 'yes' && M01_2 === 'no' && M01_3 === 'no') {
                    return 22
                }
                if (M01_1 === 'yes' && M01_2 === 'no' && M01_3 === 'yes') {
                    return 32
                }
                if (M01_1 === 'yes' && M01_2 === 'yes' && M01_3 === 'no') {
                    return 36
                }
                if (M01_1 === 'yes' && M01_2 === 'yes' && M01_3 === 'yes') {
                    return 46
                }
            }]
        },
        {
            "title": "M02 מערך לוחות סולריים",
            "description": "הלוחות הסולאריים צריכים לנטות כלפיכם או מכם והלאה.",
            "objectives": [{
                    "id": "M02_1",
                    "title": "שני הלוחות הסולאריים נוטים כלפי אותה זירה",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M02_2",
                    "title": "הלוח הסולארי שלכם נוטה לזירה של הקבוצה השנייה",
                    "type": "yesno",
                    "default": "no"
                }
            ],
            "score": [function(M02_1, M02_2) {
                if (M02_1 === 'no' && M02_2 === 'no') {
                    return 0
                }
                if (M02_1 === 'no' && M02_2 === 'yes') {
                    return 18
                }
                if (M02_1 === 'yes' && M02_2 === 'no') {
                    return 22
                }
                if (M02_1 === 'yes' && M02_2 === 'yes') {
                    return 40
                }
            }]
        },
        {
            "title": "M03 הדפסה בתלת מימד",
            "description": "גרמו לפליטה של לבנת ה-4X2 *על ידי הנחת דגימת ליבה של רגולית' במדפסת התלת מימד.",
            "objectives": [{
                    "id": "M03_1",
                    "title": "2x4 לבנת ה-2X4 נפלטה (ע”י הנחת דגימת ליבה של רגולית’ במדפסת התלת מימד בלבד)",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M03_2",
                    "title": "2x4 לבנת ה-2X4 לגמרי באזור כוכב הלכת הצפון מזרחי",
                    "type": "yesno",
                    "default": "no"
                }
            ],
            "score": [function(M03_1, M03_2) {
                if (M03_1 === 'no' && M03_2 === 'no') {
                    return 0
                }
                if (M03_1 === 'no' && M03_2 === 'yes') {
                    return 0
                }
                if (M03_1 === 'yes' && M03_2 === 'no') {
                    return 18
                }
                if (M03_1 === 'yes' && M03_2 === 'yes') {
                    return 22
                }
            }]
        },
        {
            "title": "M04 חציית מכתשים",
            "description": "הרובוט או כל רכב אחר אותו הוא שולח צריך לחצות לגמרי את דגם המכתשים, ע\"י נסיעה ישירה מעליו. לא לידו. לא מסביבו.",
            "objectives": [{
                    "id": "M04_1",
                    "title": "כל החלקים התומכים במשקל של הציוד המשמש למעבר חצו לגמרי בין המגדלים",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M04_2",
                    "title": "כל הציוד המשמש למעבר חצה ממזרח למערב, לגמרי מעבר לשער המורד",
                    "type": "yesno",
                    "default": "no"
                }
            ],
            "score": [function(M04_1, M04_2) {
                if (M04_1 === 'no' && M04_2 === 'no') {
                    return 0
                }
                if (M04_1 === 'no' && M04_2 === 'yes') {
                    return 0
                }
                if (M04_1 === 'yes' && M04_2 === 'no') {
                    return 0
                }
                if (M04_1 === 'yes' && M04_2 === 'yes') {
                    return 20
                }
            }]
        },
        {
            "title": "M05 כריית משאבים",
            "description": "הרובוט צריך להשיג את כל דגימות הליבה מתוך דגם אתר הליבה, ואז יש לו מספר אפשרויות מה לעשות איתן, כמתואר כאן ובמשימה M03",
            "objectives": [{
                    "id": "M05_1",
                    "title": "כל ארבע דגימות הליבה לא נוגעות יותר במוט שהחזיק אותן בתוך דגם אתר הליבה",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M05_2",
                    "title": "דגימת הליבה של הגז נוגעת בשטיח ולגמרי בתוך עיגול המטרה של רכב הנחיתה",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M05_3",
                    "title": "-או- דגימת הליבה של הגז לגמרי בתוך הבסיס",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M05_4",
                    "title": "דגימת הליבה של המים נתמכת ע\"י תא גידול המזון בלבד",
                    "type": "yesno",
                    "default": "no"
                }
            ],
            "score": [function(M05_1, M05_2, M05_3, M05_4) {
                if (M05_1 === 'no' && M05_2 === 'no' && M05_3 === 'no' && M05_4 === 'no') {
                    return 0
                }
                if (M05_1 === 'no' && M05_2 === 'yes' && M05_3 === 'no' && M05_4 === 'no') {
                    return 12
                }
                if (M05_1 === 'no' && M05_2 === 'no' && M05_3 === 'yes' && M05_4 === 'no') {
                    return 10
                }
                if (M05_1 === 'no' && M05_2 === 'yes' && M05_3 === 'yes' && M05_4 === 'no') {
                    return new Error("מיקום דגימת הליבה של הגז")
                }
                if (M05_1 === 'no' && M05_2 === 'no' && M05_3 === 'no' && M05_4 === 'yes') {
                    return 8
                }
                if (M05_1 === 'no' && M05_2 === 'yes' && M05_3 === 'no' && M05_4 === 'yes') {
                    return 20
                }
                if (M05_1 === 'no' && M05_2 === 'no' && M05_3 === 'yes' && M05_4 === 'yes') {
                    return 18
                }
                if (M05_1 === 'no' && M05_2 === 'yes' && M05_3 === 'yes' && M05_4 === 'yes') {
                    return new Error("מיקום דגימת הליבה של הגז")
                }
                if (M05_1 === 'yes' && M05_2 === 'no' && M05_3 === 'no' && M05_4 === 'no') {
                    return 16
                }
                if (M05_1 === 'yes' && M05_2 === 'yes' && M05_3 === 'no' && M05_4 === 'no') {
                    return 28
                }
                if (M05_1 === 'yes' && M05_2 === 'no' && M05_3 === 'yes' && M05_4 === 'no') {
                    return 26
                }
                if (M05_1 === 'yes' && M05_2 === 'yes' && M05_3 === 'yes' && M05_4 === 'no') {
                    return new Error("מיקום דגימת הליבה של הגז")
                }
                if (M05_1 === 'yes' && M05_2 === 'no' && M05_3 === 'no' && M05_4 === 'yes') {
                    return 24
                }
                if (M05_1 === 'yes' && M05_2 === 'yes' && M05_3 === 'no' && M05_4 === 'yes') {
                    return 36
                }
                if (M05_1 === 'yes' && M05_2 === 'no' && M05_3 === 'yes' && M05_4 === 'yes') {
                    return 34
                }
                if (M05_1 === 'yes' && M05_2 === 'yes' && M05_3 === 'yes' && M05_4 === 'yes') {
                    return new Error("מיקום דגימת הליבה של הגז")
                }
            }]
        },
        {
            "title": "M06 רכיבי תחנת החלל",
            "description": "הרובוט צריך להסיר ולחבר רכיבים בין השקעים של אתר הביות.לרכיבים שהוכנסו אסור לגעת בשום דבר מלבד אתר הביות.",
            "objectives": [{
                    "id": "M06_1",
                    "title": "הרכיב החרוטי לגמרי בתוך הבסיס",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M06_2",
                    "title": "הרכיב הגלילי הוכנס לתוך השקע המערבי של אתר הביות",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M06_3",
                    "title": "רכיב העגינה הוכנס לתוך השקע המזרחי של אתר הביות",
                    "type": "yesno",
                    "default": "no"
                }
            ],
            "score": [function(M06_1, M06_2, M06_3) {
                if (M06_1 === 'no' && M06_2 === 'no' && M06_3 === 'no') {
                    return 0
                }
                if (M06_1 === 'no' && M06_2 === 'no' && M06_3 === 'yes') {
                    return 14
                }
                if (M06_1 === 'no' && M06_2 === 'yes' && M06_3 === 'no') {
                    return 16
                }
                if (M06_1 === 'no' && M06_2 === 'yes' && M06_3 === 'yes') {
                    return 30
                }
                if (M06_1 === 'yes' && M06_2 === 'no' && M06_3 === 'no') {
                    return 16
                }
                if (M06_1 === 'yes' && M06_2 === 'no' && M06_3 === 'yes') {
                    return 30
                }
                if (M06_1 === 'yes' && M06_2 === 'yes' && M06_3 === 'no') {
                    return 32
                }
                if (M06_1 === 'yes' && M06_2 === 'yes' && M06_3 === 'yes') {
                    return 46
                }
            }]
        },
        {
            "title": "M07 הליכת חלל בחירום",
            "description": "הרובוט צריך להכניס את הגוף של גרהרד לתא האוויר.",
            "objectives": [{
                "id": "M07",
                "title": "האסטרונאוט \"ג'רהרד\" הוכנס לתוך תא האוויר של אתר הביות",
                "options": [{
                        "value": "none",
                        "title": "לא"
                    },
                    {
                        "value": "partially",
                        "title": "באופן חלקי"
                    },
                    {
                        "value": "completely",
                        "title": "לגמרי בתוך"
                    }
                ],
                "type": "enum",
                "default": "none"
            }],
            "score": [function(M07) {
                if (M07 === 'none') {
                    return 0
                }
                if (M07 === 'partially') {
                    return 18
                }
                if (M07 === 'completely') {
                    return 22
                }
            }]
        },
        {
            "title": "M08 פעילות אירובית",
            "description": "הרובוט צריך להזיז שוב ושוב את אחת או שתי הידיות המורכבות על מכשיר הכושר כדי לגרום למחוג להתקדם. (אם המחוג מכסה באופן חלקי את הגבול האחרון של הצבע הכתום או האפור , בחרו בצבע הזה)",
            "objectives": [{
                "id": "M08",
                "title": "קצה מחוג דגם הפעילות האירובית בתחום (ע\"י הזזת אחת או שתי הידיות המורכבות עליו בלבד):",
                "options": [{
                        "value": "none",
                        "title": "כלום"
                    },
                    {
                        "value": "gray",
                        "title": "אפור"
                    },
                    {
                        "value": "white",
                        "title": "לבן"
                    },
                    {
                        "value": "orange",
                        "title": "כתום"
                    }
                ],
                "type": "enum",
                "default": "none"
            }],
            "score": [function(M08) {
                if (M08 === 'none') {
                    return 0
                }
                if (M08 === 'gray') {
                    return 18
                }
                if (M08 === 'white') {
                    return 20
                }
                if (M08 === 'orange') {
                    return 22
                }
            }]
        },
        {
            "title": "M09 תרגילי כוח",
            "description": "הרובוט צריך להרים את מוט הכוח לגובה ניקוד.",
            "objectives": [{
                "id": "M09",
                "title": "מוט הכוח מורם כך שהחור הרביעי בפס השיניים נחשף לפחות באופן חלקי",
                "type": "yesno",
                "default": "no"
            }],
            "score": [function(M09) {
                if (M09 === 'no') {
                    return 0
                }
                if (M09 === 'yes') {
                    return 16
                }
            }]
        },
        {
            "title": "M10 ייצור מזון",
            "description": "הזיזו את ידית הדחיפה למרחק הנכון במהירות הנכונה כדי להגיע לתוך טווח הניקוד הירוק.",
            "objectives": [{
                "id": "M10",
                "title": "משקולת אפורה נפלה אחרי הצבע הירוק אך לפני הבז' (ע\"י הזזת ידית הדחיפה בלבד)",
                "type": "yesno",
                "default": "no"
            }],
            "score": [function(M10) {
                if (M10 === 'no') {
                    return 0
                }
                if (M10 === 'yes') {
                    return 16
                }
            }]
        },
        {
            "title": "M11 מהירות מילוט",
            "description": "הרובוט צריך להכות על משטח הפגיעה חזק מספיק כדי שהחללית לא תיפול חזרה.",
            "objectives": [{
                "id": "M11",
                "title": "החללית נשארת למעלה (ע\"י לחיצה/חבטה במשטח הפגיעה בלבד)",
                "type": "yesno",
                "default": "no"
            }],
            "score": [function(M11) {
                if (M11 === 'no') {
                    return 0
                }
                if (M11 === 'yes') {
                    return 24
                }
            }]
        },
        {
            "title": "M12 מסלולי לויין",
            "description": "הרובוט צריך להזיז לוויין אחד או יותר למסלול החיצוני.",
            "objectives": [{
                "id": "M12",
                "title": "לווינים על או מעל האזור בין שני הקווים של המסלול החיצוני:",
                "options": [{
                        "value": "0",
                        "title": "0"
                    },
                    {
                        "value": "1",
                        "title": "1"
                    },
                    {
                        "value": "2",
                        "title": "2"
                    },
                    {
                        "value": "3",
                        "title": "3"
                    }
                ],
                "type": "enum",
                "default": "0"
            }],
            "score": [function(M12) {
                if (M12 === '0') {
                    return 0
                }
                if (M12 === '1') {
                    return 8
                }
                if (M12 === '2') {
                    return 16
                }
                if (M12 === '3') {
                    return 24
                }
            }]
        },
        {
            "title": "M13 מצפה כוכבים",
            "description": "סובבו את מצפה הכוכבים לכיוון המדויק (אם המחוג מכסה באופן חלקי את הגבול האחרון של הצבע הכתום או האפור , בחרו בצבע הזה).",
            "objectives": [{
                "id": "M13",
                "title": "קצה מחוג מצפה הכוכבים בתחום:",
                "options": [{
                        "value": "none",
                        "title": "כלום"
                    },
                    {
                        "value": "gray",
                        "title": "אפור"
                    },
                    {
                        "value": "white",
                        "title": "לבן"
                    },
                    {
                        "value": "orange",
                        "title": "כתום"
                    }
                ],
                "type": "enum",
                "default": "none"
            }],
            "score": [function(M13) {
                if (M13 === 'none') {
                    return 0
                }
                if (M13 === 'gray') {
                    return 16
                }
                if (M13 === 'white') {
                    return 18
                }
                if (M13 === 'orange') {
                    return 20
                }
            }]
        },
        {
            "title": "M14 הטיית מטאורואיד",
            "description": "ממערב לקו החופשי, שלחו מטאורואיד עצמאי אחד או שניים ללוכד המטאורואידים.",
            "objectives": [{
                    "id": "M14_1",
                    "title": "מטאורואידים נוגעים בשטיח ונמצאים בתחום המרכזי:",
                    "options": [{
                            "value": "0",
                            "title": "0"
                        },
                        {
                            "value": "1",
                            "title": "1"
                        },
                        {
                            "value": "2",
                            "title": "2"
                        }
                    ],
                    "type": "enum",
                    "default": "0"
                },
                {
                    "id": "M14_2",
                    "title": "מטאורואידים נוגעים בשטיח ונמצאים בתחום צדדי כלשהו:",
                    "options": [{
                            "value": "0",
                            "title": "0"
                        },
                        {
                            "value": "1",
                            "title": "1"
                        },
                        {
                            "value": "2",
                            "title": "2"
                        }
                    ],
                    "type": "enum",
                    "default": "0"
                }
            ],
            "score": [function(M14_1, M14_2) {
                if (M14_1 === '0' && M14_2 === '0') {
                    return 0
                }
                if (M14_1 === '0' && M14_2 === '1') {
                    return 8
                }
                if (M14_1 === '0' && M14_2 === '2') {
                    return 16
                }
                if (M14_1 === '1' && M14_2 === '0') {
                    return 12
                }
                if (M14_1 === '1' && M14_2 === '1') {
                    return 20
                }
                if (M14_1 === '1' && M14_2 === '2') {
                    return new Error("צירוף בלתי אפשרי. יותר מדי מטאורואידים")
                }
                if (M14_1 === '2' && M14_2 === '0') {
                    return 24
                }
                if (M14_1 === '2' && M14_2 === '1') {
                    return new Error("צירוף בלתי אפשרי. יותר מדי מטאורואידים")
                }
                if (M14_1 === '2' && M14_2 === '2') {
                    return new Error("צירוף בלתי אפשרי. יותר מדי מטאורואידים")
                }
            }]
        },
        {
            "title": "M15 נחיתת רכב הנחיתה",
            "description": "הביאו את רכב הנחיתה לאחת המטרות שלו כשהוא שלם, או לפחות הביאו אותו לבסיס.",
            "objectives": [{
                    "id": "M15_1",
                    "title": "רכב הנחיתה שלם ונוגע בשטיח",
                    "type": "yesno",
                    "default": "no"
                },
                {
                    "id": "M15_2",
                    "title": "רכב הנחיתה לגמרי בתוך:",
                    "options": [{
                            "value": "no",
                            "title": "כלום"
                        },
                        {
                            "value": "base",
                            "title": "בסיס"
                        },
                        {
                            "value": "planet",
                            "title": "באזור כוכב הלכת הצפון מזרחי"
                        },
                        {
                            "value": "circle",
                            "title": "בתוך עיגול המטרה"
                        }
                    ],
                    "type": "enum",
                    "default": "no"
                }
            ],
            "score": [function(M15_1, M15_2) {
                if (M15_1 === 'no' && M15_2 === 'no') {
                    return 0
                }
                if (M15_1 === 'no' && M15_2 === 'base') {
                    return 16
                }
                if (M15_1 === 'no' && M15_2 === 'circle') {
                    return 0
                }
                if (M15_1 === 'no' && M15_2 === 'planet') {
                    return 0
                }
                if (M15_1 === 'yes' && M15_2 === 'no') {
                    return 0
                }
                if (M15_1 === 'yes' && M15_2 === 'base') {
                    return 16
                }
                if (M15_1 === 'yes' && M15_2 === 'planet') {
                    return 20
                }
                if (M15_1 === 'yes' && M15_2 === 'circle') {
                    return 22
                }
            }]
        },
        {
            "title": "עונשין",
            "description": "אתם רשאים להציל את הרובוט שלכם בעזרת הידיים, אבל זה גורם לעונשין הזה.",
            "objectives": [{
                "id": "penalties",
                "title": "דיסקיות עונשין במשולש הדרום מזרחי:",
                "options": [{
                        "value": "0",
                        "title": "0"
                    },
                    {
                        "value": "1",
                        "title": "1"
                    },
                    {
                        "value": "2",
                        "title": "2"
                    },
                    {
                        "value": "3",
                        "title": "3"
                    },
                    {
                        "value": "4",
                        "title": "4"
                    },
                    {
                        "value": "5",
                        "title": "5"
                    },
                    {
                        "value": "6",
                        "title": "6"
                    }
                ],
                "type": "enum",
                "default": "0"
            }],
            "score": [function(penalties) {
                if (penalties === '0') {
                    return 0
                }
                if (penalties === '1') {
                    return -3
                }
                if (penalties === '2') {
                    return -6
                }
                if (penalties === '3') {
                    return -9
                }
                if (penalties === '4') {
                    return -12
                }
                if (penalties === '5') {
                    return -15
                }
                if (penalties === '6') {
                    return -18
                }
            }]
        }
    ],
    "strings": {
        "yes": "כן",
        "no": "לא",
        "M01-name": "M01 נסיעה בחלל",
        "M01-desc": "התחילו לגלגל כל מטען בברור במורד הרציף לנסיעה בחלל בכל גלגול העגלה חייבת *להיות עצמאית בזמן בו היא מגיעה לחיבור המסילה הראשון*",
        "M01-scoring1": "מטען רכב עבר את חיבור המסילה הראשון",
        "M01-scoring2": "מטען אספקה עבר את חיבור המסילה הראשון",
        "M01-scoring3": "מטען צוות עבר את חיבור המסילה הראשון",
        "M02-name": "M02 מערך לוחות סולריים",
        "M02-desc": "הלוחות הסולאריים צריכים לנטות כלפיכם או מכם והלאה.",
        "M02-scoring1": "שני הלוחות הסולאריים נוטים כלפי אותה זירה",
        "M02-scoring2": "הלוח הסולארי שלכם נוטה לזירה של הקבוצה השנייה",
        "M03-name": "M03 הדפסה בתלת מימד",
        "M03-desc": "גרמו לפליטה של לבנת ה-4X2 *על ידי הנחת דגימת ליבה של רגולית' במדפסת התלת מימד.",
        "M03-scoring1": "2x4 לבנת ה-2X4 נפלטה (ע”י הנחת דגימת ליבה של רגולית’ במדפסת התלת מימד בלבד)",
        "M03-scoring2": "2x4 לבנת ה-2X4 לגמרי באזור כוכב הלכת הצפון מזרחי",
        "M04-name": "M04 חציית מכתשים",
        "M04-desc": "הרובוט או כל רכב אחר אותו הוא שולח צריך לחצות לגמרי את דגם המכתשים, ע\"י נסיעה ישירה מעליו. לא לידו. לא מסביבו.",
        "M04-scoring1": "כל החלקים התומכים במשקל של הציוד המשמש למעבר חצו לגמרי בין המגדלים",
        "M04-scoring2": "כל הציוד המשמש למעבר חצה ממזרח למערב, לגמרי מעבר לשער המורד",
        "M05-name": "M05 כריית משאבים",
        "M05-desc": "הרובוט צריך להשיג את כל דגימות הליבה מתוך דגם אתר הליבה, ואז יש לו מספר אפשרויות מה לעשות איתן, כמתואר כאן ובמשימה M03",
        "M05-scoring1": "כל ארבע דגימות הליבה לא נוגעות יותר במוט שהחזיק אותן בתוך דגם אתר הליבה",
        "M05-scoring2": "דגימת הליבה של הגז נוגעת בשטיח ולגמרי בתוך עיגול המטרה של רכב הנחיתה",
        "M05-scoring3": "-או- דגימת הליבה של הגז לגמרי בתוך הבסיס",
        "M05-scoring4": "דגימת הליבה של המים נתמכת ע\"י תא גידול המזון בלבד",
        "M05-error": "מיקום דגימת הליבה של הגז",
        "M06-name": "M06 רכיבי תחנת החלל",
        "M06-desc": "הרובוט צריך להסיר ולחבר רכיבים בין השקעים של אתר הביות.לרכיבים שהוכנסו אסור לגעת בשום דבר מלבד אתר הביות.",
        "M06-scoring1": "הרכיב החרוטי לגמרי בתוך הבסיס",
        "M06-scoring2": "הרכיב הגלילי הוכנס לתוך השקע המערבי של אתר הביות",
        "M06-scoring3": "רכיב העגינה הוכנס לתוך השקע המזרחי של אתר הביות",
        "M07-name": "M07 הליכת חלל בחירום",
        "M07-desc": "הרובוט צריך להכניס את הגוף של גרהרד לתא האוויר.",
        "M07-scoring": "האסטרונאוט \"ג'רהרד\" הוכנס לתוך תא האוויר של אתר הביות",
        "M07-scoring1": "לא",
        "M07-scoring2": "באופן חלקי",
        "M07-scoring3": "לגמרי בתוך",
        "M08-name": "M08 פעילות אירובית",
        "M08-desc": "הרובוט צריך להזיז שוב ושוב את אחת או שתי הידיות המורכבות על מכשיר הכושר כדי לגרום למחוג להתקדם. (אם המחוג מכסה באופן חלקי את הגבול האחרון של הצבע הכתום או האפור , בחרו בצבע הזה)",
        "M08-scoring": "קצה מחוג דגם הפעילות האירובית בתחום (ע\"י הזזת אחת או שתי הידיות המורכבות עליו בלבד):",
        "M08-scoring1": "כלום",
        "M08-scoring2": "אפור",
        "M08-scoring3": "לבן",
        "M08-scoring4": "כתום",
        "M09-name": "M09 תרגילי כוח",
        "M09-desc": "הרובוט צריך להרים את מוט הכוח לגובה ניקוד.",
        "M09-scoring": "מוט הכוח מורם כך שהחור הרביעי בפס השיניים נחשף לפחות באופן חלקי",
        "M10-name": "M10 ייצור מזון",
        "M10-desc": "הזיזו את ידית הדחיפה למרחק הנכון במהירות הנכונה כדי להגיע לתוך טווח הניקוד הירוק.",
        "M10-scoring": "משקולת אפורה נפלה אחרי הצבע הירוק אך לפני הבז' (ע\"י הזזת ידית הדחיפה בלבד)",
        "M11-name": "M11 מהירות מילוט",
        "M11-desc": "הרובוט צריך להכות על משטח הפגיעה חזק מספיק כדי שהחללית לא תיפול חזרה.",
        "M11-scoring": "החללית נשארת למעלה (ע\"י לחיצה/חבטה במשטח הפגיעה בלבד)",
        "M12-name": "M12 מסלולי לויין",
        "M12-desc": "הרובוט צריך להזיז לוויין אחד או יותר למסלול החיצוני.",
        "M12-scoring": "לווינים על או מעל האזור בין שני הקווים של המסלול החיצוני:",
        "M13-name": "M13 מצפה כוכבים",
        "M13-desc": "סובבו את מצפה הכוכבים לכיוון המדויק (אם המחוג מכסה באופן חלקי את הגבול האחרון של הצבע הכתום או האפור , בחרו בצבע הזה).",
        "M13-scoring": "קצה מחוג מצפה הכוכבים בתחום:",
        "M13-scoring1": "כלום",
        "M13-scoring2": "אפור",
        "M13-scoring3": "לבן",
        "M13-scoring4": "כתום",
        "M14-name": "M14 הטיית מטאורואיד",
        "M14-desc": "ממערב לקו החופשי, שלחו מטאורואיד עצמאי אחד או שניים ללוכד המטאורואידים.",
        "M14-scoring1": "מטאורואידים נוגעים בשטיח ונמצאים בתחום המרכזי:",
        "M14-scoring2": "מטאורואידים נוגעים בשטיח ונמצאים בתחום צדדי כלשהו:",
        "M14-error": "צירוף בלתי אפשרי. יותר מדי מטאורואידים",
        "M15-name": "M15 נחיתת רכב הנחיתה",
        "M15-desc": "הביאו את רכב הנחיתה לאחת המטרות שלו כשהוא שלם, או לפחות הביאו אותו לבסיס.",
        "M15-scoring1": "רכב הנחיתה שלם ונוגע בשטיח",
        "M15-scoring2": "רכב הנחיתה לגמרי בתוך:",
        "M15-scoring3": "כלום",
        "M15-scoring4": "בסיס",
        "M15-scoring5": "באזור כוכב הלכת הצפון מזרחי",
        "M15-scoring6": "בתוך עיגול המטרה",
        "penalties-name": "עונשין",
        "penalties-desc": "אתם רשאים להציל את הרובוט שלכם בעזרת הידיים, אבל זה גורם לעונשין הזה.",
        "penalties-scoring": "דיסקיות עונשין במשולש הדרום מזרחי:"
    },
    "rtl": true
})`
export default challenge
